Two elements were not automatically joined because one or both is not editable.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId WorksetJoinWarn { get; }
  Visual Basic
Public Shared ReadOnly Property WorksetJoinWarn As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ WorksetJoinWarn {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures AutoJoinFailures Class
  Autodesk.Revit.DB Namespace